trait = '—————————————————————————————————————————————————————————————————————————————————————————————————————'

photo = '''
|.####..##........####.....###.............##.....##..####..##.....##..########..########..##.....##|
|..##...##.........##.....##.##............###...###...##...##.....##..##........##........##.....##|
|..##...##.........##....##...##...........####.####...##...##.....##..##........##........##.....##|
|..##...##.........##...##.....##..........##.###.##...##...#########..######....######....##.....##|
|..##...##.........##...#########..........##.....##...##...##.....##..##........##.........##...##.|
|..##...##.........##...##.....##..........##.....##...##...##.....##..##........##..........##.##..|
|.####..########..####..##.....##..........##.....##..####..##.....##..########..########.....###...|
'''

endings = {
    'е': {
        'xyz': 'Хуе',
    },
    'о': {
        'xyz': 'Хуё',
    },
    'у': {
        'xyz': 'Хую',
    },
    'ь': {
        'xyz': 'Ху',
    },
    'а': {
        'xyz': 'Хуя',
    },
    'ё': {
        'xyz': 'Хуё',
    },
    'и': {
        'xyz': 'Хуи',
    },
    'я': {
        'xyz': 'Хуя',
    }
}

def capitalize_after_space(word):
    count = 0
    elem = " ".join(word.replace(" ", " ").split()).capitalize()
    for bykva in elem:
        count += 1
        if bykva == ' ':
            elem = elem[:count] + elem[count].upper() + elem[count+1:]
    return elem

def clear_console():
    import os
    operating_system = os.name
    if operating_system == 'posix':
        _ = os.system('clear')
    elif operating_system == 'nt' or operating_system == 'dos':
        _ = os.system('cls')
    else:
        print("Очистка консоли не поддерживается на данной операционной системе.")

def zapis():
    import user
    word = f"user = {{\n    'instruction': {user.user['instruction']},\n    'name': '{user.user['name']}',\n}}"
    with open('user.py', 'w', encoding="utf-8") as file:
        file.write(word)
    clear_console()